---
kind: type
id: T:Autodesk.Revit.DB.Events.DataTransferMode
source: html/970e779d-cfc8-9b58-eb88-bf23df21477c.htm
---
# Autodesk.Revit.DB.Events.DataTransferMode

Describes the data transfer mode.

## Syntax (C#)
```csharp
public enum DataTransferMode
```